000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/БонусныеБаллыПогашение/БонусныеБаллыПогашение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БонусныеБаллыПогашение</name>
  <resources>
    <name>СуммаБонусныхБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийБонусныхБаллов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <comment>Дата регистратора</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОперации</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.НачислениеИСписаниеБонусныхБаллов</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>(Служ.)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.ПрограммыЛояльности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументНачисления</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.НачислениеИСписаниеБонусныхБаллов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/БонусныеБаллы/БонусныеБаллы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БонусныеБаллы</name>
  <comment>Основной раздел учёта системы бонусных накоплений</comment>
  <resources>
    <name>СуммаБонусныхБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Авария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийБонусныхБаллов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <comment>Дата регистратора</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОперации</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.НачислениеИСписаниеБонусныхБаллов</types>
    </type>
  </attributes>
  <attributes>
    <name>Перенос_ДокументНачисления</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.НачислениеИСписаниеБонусныхБаллов</types>
    </type>
  </attributes>
  <attributes>
    <name>Перенос_ПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.ПрограммыЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>(Служ.)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБонусныхБалловОригинал</name>
    <comment>Сумма до изменения при списании</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.ПрограммыЛояльности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументНачисления</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.НачислениеИСписаниеБонусныхБаллов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/БонусныеБаллыПогашение/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеВлиянияНаПоследовательность(НаборЗаписей, ИмяСобытия)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Если ИмяСобытия = "ПередЗаписью" Тогда

	//	Текущее состояние набора помещается во временную таблицу "ДвиженияБонусныеБаллыПередЗаписью",
	//	чтобы при записи получить изменение нового набора относительно текущего.
		Запрос = Новый Запрос(БонусныеБаллыСервер.ТекстЗапросаРегистраторы() + Символы.ПС +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.Период КАК Период,
		|	Фильтр.Регистратор КАК Регистратор,
		|	Фильтр.Проведен КАК Проведен,
		|	Таблица.ПрограммаЛояльности КАК ПрограммаЛояльностиПередЗаписью,
		|	Таблица.Контрагент КАК Контрагент,
		|	Таблица.СуммаБонусныхБаллов КАК СуммаБонусныхБалловПередЗаписью,
		|	Фильтр.Дата КАК ДатаОперации
		|ПОМЕСТИТЬ ДвиженияБонусныеБаллыПередЗаписью
		|ИЗ
		|	РегистрНакопления.БонусныеБаллы КАК Таблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Фильтр КАК Фильтр
		|		ПО Таблица.Регистратор = Фильтр.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Фильтр"
		);	//	Дата документа в обработчиках "ПередЗаписью" и "ПриЗаписи" может отличаться

		Запрос.УстановитьПараметр("Регистратор", НаборЗаписей.Отбор.Регистратор.Значение);
		Запрос.МенеджерВременныхТаблиц = НаборЗаписей.ДополнительныеСвойства.УправлениеПоследовательностьюБонусныеБаллы.МенеджерВременныхТаблиц;

		Запрос.Выполнить();

	ИначеЕсли ИмяСобытия = "ПриЗаписи" Тогда

	//	Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	//	и помещается во временную таблицу.
		Запрос = Новый Запрос(БонусныеБаллыСервер.ТекстЗапросаРегистраторы() + Символы.ПС +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(ТаблицаДвижений.Период) КАК Период,
		|	МАКСИМУМ(ТаблицаДвижений.Регистратор) КАК Регистратор,
		|	ТаблицаДвижений.Контрагент КАК Контрагент,
		|	МАКСИМУМ(ТаблицаДвижений.ПрограммаЛояльностиПередЗаписью) КАК ПрограммаЛояльностиПередЗаписью,
		|	МАКСИМУМ(ТаблицаДвижений.ПрограммаЛояльностиПриЗаписи) КАК ПрограммаЛояльностиПриЗаписи,
		|	СУММА(ТаблицаДвижений.СуммаБонусныхБалловПередЗаписью) КАК СуммаБонусныхБалловПередЗаписью,
		|	СУММА(ТаблицаДвижений.СуммаБонусныхБалловПриЗаписи) КАК СуммаБонусныхБалловПриЗаписи,
		|	ТаблицаДвижений.ДатаОперации КАК ДатаОперации,
		|	МАКСИМУМ(ТаблицаДвижений.Проведен) КАК Проведен
		|ПОМЕСТИТЬ БонусныеБаллыДвижения
		|ИЗ
		|	(ВЫБРАТЬ
		|		Таблица.Период КАК Период,
		|		Таблица.Регистратор КАК Регистратор,
		|		ЛОЖЬ КАК Проведен,
		|		Таблица.ПрограммаЛояльностиПередЗаписью КАК ПрограммаЛояльностиПередЗаписью,
		|		ЗНАЧЕНИЕ(Справочник.ПрограммыЛояльности.ПустаяСсылка) КАК ПрограммаЛояльностиПриЗаписи,
		|		Таблица.Контрагент КАК Контрагент,
		|		Таблица.ДатаОперации КАК ДатаОперации,
		|		Таблица.СуммаБонусныхБалловПередЗаписью КАК СуммаБонусныхБалловПередЗаписью,
		|		0 КАК СуммаБонусныхБалловПриЗаписи
		|	ИЗ
		|		ДвиженияБонусныеБаллыПередЗаписью КАК Таблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Таблица.Период,
		|		Фильтр.Регистратор,
		|		Фильтр.Проведен,
		|		ЗНАЧЕНИЕ(Справочник.ПрограммыЛояльности.ПустаяСсылка),
		|		Таблица.ПрограммаЛояльности,
		|		Таблица.Контрагент,
		|		Фильтр.Дата,
		|		0,
		|		Таблица.СуммаБонусныхБаллов
		|	ИЗ
		|		РегистрНакопления.БонусныеБаллы КАК Таблица
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Фильтр КАК Фильтр
		|			ПО Таблица.Регистратор = Фильтр.Регистратор) КАК ТаблицаДвижений
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДвижений.Контрагент,
		|	ТаблицаДвижений.ДатаОперации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДвиженияБонусныеБаллыПередЗаписью
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Фильтр"
		);

		Запрос.УстановитьПараметр("Регистратор", НаборЗаписей.Отбор.Регистратор.Значение);
		Запрос.МенеджерВременныхТаблиц = НаборЗаписей.ДополнительныеСвойства.УправлениеПоследовательностьюБонусныеБаллы.МенеджерВременныхТаблиц;

		Запрос.Выполнить();

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
	
#КонецЕсли
